app/Controllers/API/AuthController.php

SELECT *
FROM `users`
WHERE `user_id_code` = 'ADMIN-001'
 LIMIT 1
---
    public function login() {
        $userModel = new UserModel();
        $userIdCode = $this->request->getJSON()->user_id_code ?? '';
        $password = $this->request->getJSON()->password ?? '';
        $user = $userModel->where('user_id_code', $userIdCode)->first();