app/Controllers/API/DashboardController.php

    public function getDashboardData()
    {
        $db = \Config\Database::connect();

        // --- 1. STATS ---
        $userModel = new UserModel();
        $qualificationModel = new QualificationModel();
        $enrollmentModel = new EnrollmentModel();

        $stats = [
            'totalTrainees' => $userModel->where('role', 'trainee')->countAllResults(),
            'activeQualifications' => $qualificationModel->where('is_active', true)->countAllResults(),
            'pendingPayments' => 0,
            'completedTrainings' => $enrollmentModel->where('status', 'completed')->countAllResults(),
            'traineesChange' => 0,
            'completedChange' => 0,
        ];

        // --- 2. RECENT ACTIVITY (Corrected with LEFT JOIN) ---
        $recentTrainees = $db->table('users')
            ->select('users.id, users.created_at, trainee_details.first_name, trainee_details.last_name')
            // Using a LEFT JOIN is more robust
            ->join('trainee_details', 'trainee_details.user_id = users.id', 'left')
            ->where('users.role', 'trainee')
            ->orderBy('users.created_at', 'DESC')
            ->limit(5)
            ->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `qualifications`
WHERE `is_active` = 1
AND `qualifications`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `status` = 'completed'
SELECT `users`.`id`, `users`.`created_at`, `trainee_details`.`first_name`, `trainee_details`.`last_name`
FROM `users`
LEFT JOIN `trainee_details` ON `trainee_details`.`user_id` = `users`.`id`
WHERE `users`.`role` = 'trainee'
ORDER BY `users`.`created_at` DESC
 LIMIT 5



        // --- 3. COURSE POPULARITY ---
        $popularityData = $db->table('enrollments')
            ->select('qualifications.qualification_name, COUNT(enrollments.id) as enrollment_count')
            ->join('qualifications', 'qualifications.id = enrollments.qualification_id')
            ->groupBy('qualifications.qualification_name')
            ->orderBy('enrollment_count', 'DESC')
            ->limit(5)
            ->get()->getResultArray();
---
SELECT `qualifications`.`qualification_name`, COUNT(enrollments.id) as enrollment_count
FROM `enrollments`
JOIN `qualifications` ON `qualifications`.`id` = `enrollments`.`qualification_id`
GROUP BY `qualifications`.`qualification_name`
ORDER BY `enrollment_count` DESC
 LIMIT 5